section .data
    msg db 'Hello, World!', 0xA  ; Строка для вывода, 0xA это символ переноса строки (\n)
    len equ $ - msg              ; Автоматическое вычисление длины строки (текущий адрес минус адрес msg)

section .text
    global _start                ; Объявление глобальной метки (точки входа) для линкера

_start:
    ; 1) Подготовка системного вызова sys_write (вывод текста)
    mov rax, 1                   ; Номер системного вызова sys_write для Linux x64 (1)
    mov rdi, 1                   ; Файловый дескриптор 1 (stdout стандартный вывод на экран)
    mov rsi, msg                 ; Указатель на начало строки данных
    mov rdx, len                 ; Длина строки в байтах
    syscall                      ; Выполнение системного вызова (обращение к ядру Linux)

    ; 2) Подготовка системного вызова sys_exit (корректное завершение)
    mov rax, 60                  ; Номер системного вызоыва sys_exit для Linux x64 (60)
    mov rdi, 0                   ; Код возврата 0 (программа завершена без ошибок)
    syscall                      ; Выполнение системного вызова