massiv = [2, 4, 0, 1, 3, 5, 6, 2, 3, 2, 4, 0, 5]
limit = 15

# l - левая граница нашего "окна" (откуда начинаем выкладывать)
l = 0
current_sum = 0
max_diap = 0 # Здесь храним максимальную длину подходящего подмассива

# r - правая граница (идем вперед и жадно собираем числа)
for r in range(len(massiv)):
    
    # Добавляем в окно новое число справа
    current_sum += massiv[r] 
    
    # Если сумма стала больше лимита (15), окно нужно "сжать" слева.
    # Мы вычитаем число, на которое указывает l, и сдвигаем l на шаг вправо.
    # Делаем это в цикле while, пока сумма не вернется в норму.
    while current_sum > limit and l <= r:
        current_sum -= massiv[l]
        l += 1
        
    # Если мы дошли до этой строки, значит сумма в окне <= 15.
    # Считаем, сколько элементов сейчас в окне (формула: правый - левый + 1)
    current_diap = r - l + 1
    
    # Обновляем рекорд, если текущее окно длиннее
    max_diap = max(max_diap, current_diap)

print(f"Максимальная длина подмассива: {max_diap}")